OpenFOAM/1_HeleShawRT/sims/n13sat/flow_b/constant/flowParms
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      flowParms;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

grainsize       0.00092;

meanVelocity    1e-05;

mediumVolume    0.0083429507;

bufferVolume    0.00011829815;

porsat          0.52467177;


// ************************************************************************* //
