OpenFOAM/1_HeleShawRT/sims/n13sat/flow_b/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

scale           1;

vertices        ( ( 1.33333 0 -0.5 ) ( 5043.83 0 -0.5 ) ( 5043.83 3172 -0.5 ) ( 1.33333 3172 -0.5 ) ( 1.33333 0 0.5 ) ( 5043.83 0 0.5 ) ( 5043.83 3172 0.5 ) ( 1.33333 3172 0.5 ) );

blocks          ( hex ( 0 1 2 3 4 5 6 7 ) ( 7564 4758 1 ) simpleGrading ( 1 1 1 ) );

edges           ( );

boundary        ( front { type patch ; faces ( ( 3 7 6 2 ) ) ; } back { type patch ; faces ( ( 1 5 4 0 ) ) ; } inlet { type patch ; faces ( ( 0 4 7 3 ) ) ; } outlet { type patch ; faces ( ( 2 6 5 1 ) ) ; } top { type empty ; faces ( ( 0 1 2 3 ) ) ; } bottom { type empty ; faces ( ( 4 5 6 7 ) ) ; } );


// ************************************************************************* //
